app/views/posts/new.html.erb

SELECT "categories".* FROM "categories"
---
       <br>
       <%= collection_check_boxes(:post, :category_ids, Category.all, :id, :title) do |cbox|%>