app/controllers/comments_controller.rb

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 5]]
INSERT INTO "comments" ("content", "post_id", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["content", "哈哈哈！！！"], ["post_id", "5"], ["user_id", "8"], ["created_at", "2016-07-31 12:51:10.507120"], ["updated_at", "2016-07-31 12:51:10.507120"]]
---
	def create
	  @post = Post.find(params[:post_id])
	  @comment = @post.comments.build(params.require(:comment).permit(:content))
	 	@comment.user = current_user	# setting users when creating new post and comment objects
	  if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "votes" ("voteable_id", "voteable_type", "user_id", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["voteable_id", 1], ["voteable_type", "Comment"], ["user_id", 8], ["vote", "t"], ["created_at", "2016-07-31 12:51:24.241541"], ["updated_at", "2016-07-31 12:51:24.241541"]]
---
	def vote
	  @comment = Comment.find(params[:id])
	  @vote = Vote.create(voteable: @comment, creator: current_user, vote: params[:vote])