app/controllers/posts_controller.rb

SELECT "posts".* FROM "posts"
SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 1]]
---
  def index
    @posts = Post.all.sort_by {|x| x.total_votes }.reverse
    # @posts = Post.all   # 右邊是連到mbdel；mbdel連到db;@posts是區域變數，連到view;s與否是表示找到的資料是否是一筆
    # view --> controller --> modle
    # 排序用
    @post = Post.find(1)

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 0]]
SELECT "comments".* FROM "comments" WHERE "comments"."post_id" = ?  [["post_id", "1"]]
---
  def show
    #Rails 會把用戶所有傳進來的參數打包成一個叫 params 的 Hash
    #find 代表搜尋某一比資料，而 params[:id] 代表用戶想查詢的資料 id

    @post = Post.find(params[:id])
    # post 改為posts
    # added comment form in post show page／13  app/controllers/comments_controller.rb
    @comment = Comment.new
    @comments = @post.comments.all.sort_by {|x| x.total_votes }.reverse

INSERT INTO "posts" ("title", "content", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "今天畢業了"], ["content", "上了六周的課，今天畢業了！！！！！"], ["user_id", "8"], ["created_at", "2016-07-31 12:49:42.309103"], ["updated_at", "2016-07-31 12:49:42.309103"]]
---
  def create
    #前端使用者傳回的資料，建立一個新的 post 物件
    post = Post.new(post_params)
    post.user = current_user # setting users when creating new post and comment objects
    #如果成功存進資料庫，就導回 index 頁面，失敗就再顯示一次表單
    if post.save!

SELECT  "posts".* FROM "posts" WHERE "posts"."id" = ? LIMIT 1  [["id", 4]]
INSERT INTO "votes" ("voteable_id", "voteable_type", "user_id", "vote", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["voteable_id", 4], ["voteable_type", "Post"], ["user_id", 8], ["vote", "f"], ["created_at", "2016-07-31 12:51:35.087933"], ["updated_at", "2016-07-31 12:51:35.087933"]]
---
  def vote
     @post = Post.find(params[:id])
     @vote = Vote.create(voteable: @post, creator: current_user, vote: params[:vote])