app/controllers/users_controller.rb

  def create
  	@user = User.new(user_params)

  	if @user.save
---
INSERT INTO "users" ("name", "password_digest", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["name", "jack"], ["password_digest", "$2a$10$h8VItIPOgNpgQqUyF98Rp.DMGPNFHDXs.eZAZVHqZp2vh/nedOj2W"], ["created_at", "2016-07-29 13:37:45.609947"], ["updated_at", "2016-07-29 13:37:45.609947"]]