app/controllers/users_controller.rb

  def index
  	#binding.pry
    @users = User.all
---
SELECT "users".* FROM "users"